export default class Slider {
    // описуєм кодом слайдер який буде на сторінці
    // вказуємо слайдеру на якій сторінці він буде працювати
    // які слайди будуть всередині
    // тріггери(кнопки) які будуть переключати ці слайди
    // btns - селектори кнопок які будуть переключати улументи
    // "" - потрібні для того що якщо елемент не буде переданий код буде і далі працювати
    // якщо ось ця частина що в обєкті не буде передана то замість неї підставиться пустий обєкт
    // цей запис деструктуризує оюєкт на окремі змінні які знаходяться всередині
    constructor({page = "", btns = "", next = "", prev = ""} = {}) {
        // поміщаєм ті властивості, які будуть описувати слайдер на початковому етапі
        // тобто ті речі які описують слайдер ще до того етапу як він почне працювати
        this.page = document.querySelector(page); // головний блок який є на сторінці
        this.slides = this.page.children; // слайди які будуть всередині слайдера, які необхідно буде переміщувати
        this.btns = document.querySelectorAll(btns);
        this.slideIndex = 1; // оприділятиме поточний слайд, потрібен для того щоб орієнтуватись куди рухатись далі

    }
}





